<?php
// database/seeders/OrganizationSeeder.php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Organization;

class OrganizationSeeder extends Seeder
{
    public function run(): void
    {
        $data = [
            [
                "id" => 4,
                "name" => "Федеральное государственное автономное образовательное учреждение высшего образования «Санкт-Петербургский государственный университет аэрокосмического приборостроения»",
                "shortname1" => "ФГАОУ ВО СПб ГУАП",
                "shortname2" => "ГУАП",
                "description" => null,
                "created_at" => "2025-07-10T15:52:44.000000Z",
                "updated_at" => "2025-07-10T15:52:44.000000Z",
            ],
            [
                "id" => 8,
                "name" => "Автономная некоммерческая организация высшего образования \"Санкт-Петербургская юридическая академия\"",
                "shortname1" => "АНО ВО \"СЮА\"",
                "shortname2" => "",
                "description" => null,
                "created_at" => "2025-07-10T15:52:44.000000Z",
                "updated_at" => "2025-07-10T15:52:44.000000Z",
            ],
            [
                "id" => 22,
                "name" => "Федеральное государственное казенное военное образовательное учреждение высшего образования \"Военная академия материально-технического обеспечения имени генерала армии А.В. Хрулева\" Министерства обороны РФ",
                "shortname1" => "Военная академия материально-технического обеспечения",
                "shortname2" => "ВА МТО",
                "description" => null,
                "created_at" => "2025-07-10T15:52:44.000000Z",
                "updated_at" => "2025-07-10T15:52:44.000000Z",
            ],
            [
                "id" => 26,
                "name" => "Государственное автономное учреждение культуры Республики Бурятия \"Национальная Библиотека Республики Бурятия\"",
                "shortname1" => "ГАУК РБ \"НБ РБ\"",
                "shortname2" => "",
                "description" => null,
                "created_at" => "2025-07-10T15:52:44.000000Z",
                "updated_at" => "2025-07-10T15:52:44.000000Z",
            ],
            [
                "id" => 28,
                "name" => "Санкт-Петербургское государственное бюджетное учреждение дополнительного образования «Санкт-Петербургская детская школа искусств имени М.И.Глинки»",
                "shortname1" => "СПб ГБУ ДО \"СПб ДШИ им.М.И. Глинки\"",
                "shortname2" => "",
                "description" => null,
                "created_at" => "2025-07-10T15:52:44.000000Z",
                "updated_at" => "2025-07-10T15:52:44.000000Z",
            ],
            [
                "id" => 64,
                "name" => "НИЦ «Курчатовский институт» ФГБУ ПИЯФ им. Б.П. Константинова",
                "shortname1" => "",
                "shortname2" => "",
                "description" => null,
                "created_at" => "2025-07-10T15:52:44.000000Z",
                "updated_at" => "2025-07-10T15:52:44.000000Z",
            ],
            [
                "id" => 82,
                "name" => "ЗАО \"Корпоративные Системы Обучения\"",
                "shortname1" => "",
                "shortname2" => "",
                "description" => null,
                "created_at" => "2025-07-10T15:52:44.000000Z",
                "updated_at" => "2025-07-10T15:52:44.000000Z",
            ],
            [
                "id" => 92,
                "name" => "Государственное бюджетное учреждение Калининградской области профессиональная образовательная организация \"Педагогический колледж\"",
                "shortname1" => "ГБУ КО ПОО \"Педагогический колледж\"",
                "shortname2" => "",
                "description" => null,
                "created_at" => "2025-07-10T15:52:44.000000Z",
                "updated_at" => "2025-07-10T15:52:44.000000Z",
            ],
            [
                "id" => 102,
                "name" => "Акционерное общество \"Инфосистемы Джет\"",
                "shortname1" => "АО \"Инфосистемы Джет\"",
                "shortname2" => "",
                "description" => null,
                "created_at" => "2025-07-10T15:52:44.000000Z",
                "updated_at" => "2025-07-10T15:52:44.000000Z",
            ],
        ];

        foreach ($data as $row) {
            Organization::create($row);
        }
    }
}